<a href="https://colab.research.google.com/github/FF-77/modelo_titanic/blob/main/modelo_titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


#Dados do Titanic

https://www.kaggle.com/


#Pacotes Necessários

In [26]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

#Lendo o banco de dados

In [27]:
dados = pd.read_csv('/content/tested.csv')

In [28]:
dados.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          892         0       3  ...   7.8292   NaN         Q
1          893         1       3  ...   7.0000   NaN         S
2          894         0       2  ...   9.6875   NaN         Q
3          895         0       3  ...   8.6625   NaN         S
4          896         1       3  ...  12.2875   NaN         S

[5 rows x 12 columns]

In [29]:
dados = dados.drop(['Name','Ticket','Cabin','Embarked'], axis=1)

In [30]:
dados.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0          892         0       3    male  34.5      0      0   7.8292
1          893         1       3  female  47.0      1      0   7.0000
2          894         0       2    male  62.0      0      0   9.6875
3          895         0       3    male  27.0      0      0   8.6625
4          896         1       3  female  22.0      1      1  12.2875

#Editando Chave e Variável respota

In [31]:
dados = dados.set_index(['PassengerId'])
dados = dados.rename(columns={'Survived': 'target'}, inplace = False)

In [59]:
dados.head()

             target  Pclass     Sex   Age  SibSp  Parch     Fare
PassengerId
892               0       3    male  34.5      0      0   7.8292
893               1       3  female  47.0      1      0   7.0000
894               0       2    male  62.0      0      0   9.6875
895               0       3    male  27.0      0      0   8.6625
896               1       3  female  22.0      1      1  12.2875

#Descritiva

In [60]:
dados.describe()

           target      Pclass         Age       SibSp       Parch        Fare
count  418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean     0.363636    2.265550   30.272590    0.447368    0.392344   35.627188
std      0.481622    0.841838   14.181209    0.896760    0.981429   55.907576
min      0.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%      0.000000    1.000000   21.000000    0.000000    0.000000    7.895800
50%      0.000000    3.000000   27.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   39.000000    1.000000    0.000000   31.500000
max      1.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [63]:
dados.describe(include=['O'])

         Sex
count    418
unique     2
top     male
freq     266

#Transformação dos dados

In [65]:
dados['Sex_F'] = np.where(dados['Sex'] == 'female', 1, 0)

dados['Pclass_1'] = np.where(dados['Pclass'] == 1, 1, 0)
dados['Pclass_2'] = np.where(dados['Pclass'] == 2, 1, 0)
dados['Pclass_3'] = np.where(dados['Pclass'] == 3, 1, 0)

In [67]:
dados = dados.drop(['Pclass', 'Sex'], axis = 1)

In [68]:
dados.head()

             target   Age  SibSp  Parch  ...  Sex_F  Pclass_1  Pclass_2  Pclass_3
PassengerId                              ...
892               0  34.5      0      0  ...      0         0         0         1
893               1  47.0      1      0  ...      1         0         0         1
894               0  62.0      0      0  ...      0         0         1         0
895               0  27.0      0      0  ...      0         0         0         1
896               1  22.0      1      1  ...      1         0         0         1

[5 rows x 9 columns]

In [69]:
dados.isnull().sum()

target       0
Age         86
SibSp        0
Parch        0
Fare         1
Sex_F        0
Pclass_1     0
Pclass_2     0
Pclass_3     0
dtype: int64

In [70]:
dados.fillna(0, inplace = True)

In [71]:
dados.isnull().sum()

target      0
Age         0
SibSp       0
Parch       0
Fare        0
Sex_F       0
Pclass_1    0
Pclass_2    0
Pclass_3    0
dtype: int64

#Amostragem

In [74]:
x_train, x_test, y_train, y_test = train_test_split(dados.drop(['target'], axis = 1),
                                                    dados["target"],
                                                    test_size = 0.3,
                                                    random_state = 1234)
[{'treino': x_train.shape},
 {'teste': x_test.shape}]

[{'treino': (292, 8)}, {'teste': (126, 8)}]

#Modelo

In [75]:
rndforest = RandomForestClassifier(n_estimators = 1000,
                                   criterion='gini',
                                   max_depth = 5)

rndforest.fit(x_train, y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=5, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [76]:
probabilidade = rndforest.predict_proba(dados.drop('target', axis = 1))[:,1]
classificacao = rndforest.predict(dados.drop('target', axis = 1))

In [77]:
dados['probabilidade'] = probabilidade
dados['classificacao'] = classificacao

In [78]:
dados

             target   Age  SibSp  ...  Pclass_3  probabilidade  classificacao
PassengerId                       ...
892               0  34.5      0  ...         1       0.040960              0
893               1  47.0      1  ...         1       0.909142              1
894               0  62.0      0  ...         0       0.051891              0
895               0  27.0      0  ...         1       0.038772              0
896               1  22.0      1  ...         1       0.916615              1
...             ...   ...    ...  ...       ...            ...            ...
1305              0   0.0      0  ...         1       0.043961              0
1306              1  39.0      0  ...         0       0.901839              1
1307              0  38.5      0  ...         1       0.046159              0
1308              0   0.0      0  ...         1       0.043961              0
1309              0   0.0      1  ...         1       0.077872              0

[418 rows x 11 columns]